# <center>Laboratorium Analiza i bazy danych </center>

## <center>Łączenie tabel, podzapytania i funkcje agregujące</center>

## Przykładowe tabele obrazujące łączenie

Do zobrazowania operacji łączenia zostaną użyte tabele:

```sql
CREATE TABLE shape_a (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
 
CREATE TABLE shape_b (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
```
 
Polecenie CREATE TABLE tworzy tabelę o zadanej nazwie i strukturze. Ogólna postać to:
```sql
CREATE TABLE tab_name (
    col_name1 data_type constrain,
    col_name1 data_type constrain,
    ...
);
```
Należy uzupełnić ją danymi:
```sql
INSERT INTO shape_a (id, shape)
VALUES
    (1, 'Trójkąt'),
    (2, 'Kwadrat'),
    (3, 'Deltoid'),
    (4, 'Traper');
 
INSERT INTO shape_b (id, shape)
VALUES
    (1, 'Kwadrat'),
    (2, 'Trójkąt'),
    (3, 'Romb'),
    (4, 'Równoległobok');
```
Komenda INSERT INTO pozwala na dodanie do tabeli rekordów. Ogólna postać to:

```sql
INSERT INTO tab_name (col1_name, col2_name2, ...) 
VALUES
    (val1_col1, val2_col2),
    (val2_col1, val2_col2),
    ...
```

## Inner join 

Jest to podstawowy rodzaj złączenie. Ten sposób złączenia wybiera  te wiersze, dla których warunek złączenia jest spełniony. W żadnej z łączonych tabel kolumna użyta do łączenia nie może mieć wartości NULL. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
INNER JOIN shape_b b ON a.shape = b.shape;
```
W zapytaniu powyżej użyto *aliasów* nazw tabel i column wynikowych, jest to szczególnie przydatne przy długich nazwach tabel i wprowadza czytelność w zapytaniu.

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|

## OUTER JOIN

Istnieją trzy rodzaje złączeń OUTER:
- LEFT OUTER JOIN,
- RIGHT OUTER JOIN,
- FULL OUTER JOIN.

### LEFT OUTER JOIN

Ten rodzaj złączenie zwróci wszystkie rekordy z lewej tablicy i dopasuje do nich rekordy z prawej tablicy które spełniją zadany warunek złączenia. Jeżeli w prawej tablicy nie występują rekordy spełnijące warunek złączenia z lewą w ich miejscu pojawią się wartości NULL.

#### Przykład 1:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
LEFT JOIN shape_b b ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid|NULL|NULL|
|4|Traper|NULL|NULL|

#### Przykład 2:
```sql
SELECT
    b.id id_b,
    b.shape shape_b,
    a.id id_a,
    a.shape shape_a   
FROM
    shape_b b
LEFT JOIN shape_a a ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Kwadrat|2|Kwadrat|
|2|Trójkąt|1|Trójkąt|
|3|Romb|NULL|NULL|
|4|Równoległobok|NULL|NULL|

### RIGHT OUTER JOIN

Działa jak left outer join z tym, że prawa tablica w zapytaniu jest brana w całości.

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
RIGHT JOIN shape_b b ON a.shape = b.shape;
```

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|2|Kwadrat|1|Kwadrat|
|1|Trójkąt|2|Trójkąt|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|


### FULL OUTER JOIN

Jest złączeniem które zwraca:
- wiersze dla których warunek złączenia jest spełniony,
- wiersze z lewej tabeli dla których nie ma odpowiedników w prawej,
- wiersze z prawej tabeli dla których nie ma odpowiedników w lewej. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
FULL JOIN shape_b b ON a.shape = b.shape;
```
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid"|NULL|NULL|
|4|Traper|NULL|NULL|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|

## Podzapytania

Podzapytanie zagnieżdżone SELECT znajduje się wewnątrz zewnętrznego zapytania SELECT, np. po klauzuli WHERE, HAVING lub FROM. W przypadku tego rodzaju zapytań w pierwszej kolejności wykonywane są wewnętrzne zapytania SELECT, a ich wynik jest wykorzystywany do zewnętrznego zapytania SELECT. Stąd łatwo zuważyć, że mogą one służyć do poprawy wydajności obsługi zapytania. Należy dobierać podzapytania tak by najbardziej zagnieżdżone podzapytanie zawierało najmniejszy zbiór poszukiwań. 

#### Przykład:
Jeżeli chcemy znaleźć w bazie informację o tytułach filmów zwróconych w zadanym okresie możemy wykonać następujące zapytanie:
```sql
SELECT
   film_id,
   title
FROM
   film
WHERE
   film_id IN (
      SELECT
         inventory.film_id
      FROM
         rental
      INNER JOIN inventory ON inventory.inventory_id = rental.inventory_id
      WHERE
         return_date BETWEEN '2005-05-29'
      AND '2005-05-30'
   );
```

#### Wynik
|film_id|title|
|-|-|
|307|Fellowship Autumn|
|255|Driving Polish|
|388|Gunfight Moon|
|130|Celebrity Horn|
|563|Massacre Usual|
|397|Hanky October|
|...|...|

### Używanie podzapytań

Pod zapytania mogą być używane w :
- SELECT,
- UPDATE,
- DELETE,
- Funkcjach agregujących,
- Do definiowania tabel tymczasowych.

Używając podzapytań zapytania SQL szybko mogą stać się mało czytelne. Przez co będą trudne w zrozumieniu i późniejszym utrzymaniu. W celu analizy zapytań można użyć klauzuli __EXPLAIN__, która przeanalizuje zapytanie. Klauzula ta może służyć również do porównywania wydajności zapytań

#### Przykład:
```sql
EXPLAIN SELECT
   *
FROM
   film
```

## Funkcje agregujące

Funkcje agregujące wykonują obliczenia na zestawie wierszy i zwracają pojedynczy wiersz. PostgreSQL udostępnia wszystkie standardowe funkcje agregujące SQL w następujący sposób:
- AVG () - zwraca średnią wartość.
- COUNT () - zwraca liczbę wartości.
- MAX () - zwraca maksymalną wartość.
- MIN () - zwraca minimalną wartość.
- SUM () - zwraca sumę wszystkich lub różnych wartości.

Pełna lista funkcji agregującej: https://www.postgresql.org/docs/9.5/functions-aggregate.html

Często używamy funkcji agregujących z klauzulą GROUP BY w instrukcji SELECT. W tych przypadkach klauzula GROUP BY dzieli zestaw wyników na grupy wierszy i funkcja agregująca wykonuje obliczenia dla każdej grupy, np. maksimum, minimum, średnia itp. Funkcji agregujących można używać funkcji agregujących jako wyrażeń tylko w następujących klauzulach: SELECT i HAVING.

### GROUP BY
Klauzula GROUP BY dzieli wiersze zwrócone z instrukcji SELECT na grupy. Dla  każdej grupy można zastosować funkcję agregującą, np. SUM aby obliczyć sumę pozycji lub
COUNT aby uzyskać liczbę elementów w grupach.

Poniższa instrukcja ilustruje składnię klauzuli GROUP BY:
```sql
SELECT 
    column_1, 
    aggregate_function(column_2)
FROM 
    tbl_name
GROUP BY 
    column_1;
```
Klauzula GROUP BY musi pojawić się zaraz po klauzuli FROM lub WHERE, n0astępnie GROUP BY zawiera listę  kolumna oddzielonych przecinkami. 

### HAVING
Często używamy klauzuli HAVING w połączeniu z klauzulą GROUP BY do filtrowania wierszy grup
które nie spełniają określonego warunku.

Poniższa instrukcja ilustruje typową składnię klauzuli HAVING:
```sql
SELECT
    column_1,
    aggregate_function (column_2)
FROM
    tbl_name
GROUP BY
    column_1
HAVING
    condition;
```
Klauzula HAVING ustawia warunek dla wierszy grup utworzonych przez klauzulę GROUP BY.  

Klauzula GROUP BY ma zastosowanie, podczas gdy klauzula WHERE określa wcześniej warunki dla poszczególnych wierszy.

## Zadania wprowadzające
Wykonaj zapytania przy użyciu DBMS:  
  
1. Znajdź listę wszystkich filmów o tej samej długości.
2. Znajdź wszystkich klientów mieszkających w tym samym mieście.
3. Oblicz średni koszt wypożyczenia wszystkich filmów.
4. Oblicz i wyświetl liczbę filmów we wszystkich kategoriach.
5. Wyświetl liczbę wszystkich klientów pogrupowanych według kraju.
6. Wyświetl informacje o sklepie, który ma więcej niż 100 klientów i mniej niż 300 klientów.
7. Wybierz wszystkich klientów, którzy oglądali filmy ponad 200 godzin.
8. Oblicz średnią wartość wypożyczenia filmu.
9. Oblicz średnią wartość długości filmu we wszystkich kategoriach.
10. Znajdź najdłuższe tytuły filmowe we wszystkich kategoriach.
11. Znajdź najdłuższy film we wszystkich kategoriach. Porównaj wynik z pkt 10.

## Zadanie implementacyjne
Zaimplementuj wszystkie funkcje w pliku main.py zgodnie z opisem a następnie przetestuj je w notatniku.

In [23]:
import main
import pandas as pd
from sqlalchemy import create_engine

from typing import Union, List, Tuple

# connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020');

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

df = main.film_in_category(1)
df

                     title               languge category
0             Amadeus Holy  English                Action
1          American Circus  English                Action
2       Antitrust Tomatoes  English                Action
3            Ark Ridgemont  English                Action
4      Barefoot Manchurian  English                Action
..                     ...                   ...      ...
59         Uprising Uptown  English                Action
60  Waterfront Deliverance  English                Action
61           Werewolf Lola  English                Action
62            Women Dorado  English                Action
63            Worst Banger  English                Action

[64 rows x 3 columns]

In [3]:
df = main.number_films_in_category(2)
df

    category  count
0  Animation     66

In [4]:
df = main.number_film_by_length(40, 50)
df

   length  count
0      46      5
1      47      7
2      48     11
3      49      5
4      50      9

In [5]:
df = main.client_from_city("Barcelona")
df

        city first_name last_name
0  Barcelona    Alberto   Henning

In [6]:
df = main.avg_amount_by_length(48)
df

   length       avg
0      48  4.295389

In [7]:
df = main.client_by_sum_length(3500)
df

    first_name last_name   sum
0        Craig   Morrell  3502
1       Manuel   Murrell  3504
2       Jeanne    Lawson  3508
3        Angel   Barclay  3510
4       Marion    Ocampo  3512
..         ...       ...   ...
137     Wesley      Bull  4808
138      Clara      Shaw  4808
139      Tammy   Sanders  5065
140    Eleanor      Hunt  5360
141       Karl      Seal  5388

[142 rows x 3 columns]

In [8]:
df = main.category_statistic_length('Sports')
df

  category         avg   sum  min  max
0   Sports  128.202703  9487   47  184

In [9]:
# 1. Znajdź listę wszystkich filmów o tej samej długości.
df = main.number_film_by_length(1, 1000)
df

     length  count
0        46      5
1        47      7
2        48     11
3        49      5
4        50      9
..      ...    ...
135     181     10
136     182      6
137     183      5
138     184      8
139     185     10

[140 rows x 2 columns]

In [29]:
# 2. Znajdź wszystkich klientów mieszkających w tym samym mieście.
df = pd.read_sql("SELECT city.city, count(customer.first_name)\
                            FROM customer\
                        INNER JOIN address ON address.address_id = customer.address_id\
                    INNER JOIN city ON city.city_id = address.city_id\
                        GROUP BY city.city ORDER by count(customer.first_name)", con=connection_sqlalchemy)
df

           city  count
0      Pemalang      1
1        Taguig      1
2         Tokat      1
3       Atlixco      1
4      Mukateve      1
..          ...    ...
592      Warren      1
593   Pingxiang      1
594  Greensboro      1
595      London      2
596      Aurora      2

[597 rows x 2 columns]

In [30]:
# 3. Oblicz średni koszt wypożyczenia wszystkich filmów.
df = pd.read_sql("SELECT avg(payment.amount) from payment", con=connection_sqlalchemy)
df

        avg
0  4.200606

In [31]:
# 4. Oblicz i wyświetl liczbę filmów we wszystkich kategoriach.
df = pd.read_sql("SELECT category.name as category, count(film.title) \
                            FROM film\
                            INNER JOIN language  ON language.language_id = film.language_id\
                            INNER JOIN film_category ON film_category.film_id = film.film_id\
                            INNER JOIN category ON category.category_id = film_category.category_id\
                            GROUP BY category.name", con=connection_sqlalchemy)
df

       category  count
0        Sports     74
1      Classics     57
2           New     63
3        Family     69
4        Comedy     58
5     Animation     66
6        Travel     57
7         Music     51
8         Drama     62
9        Horror     56
10       Sci-Fi     61
11        Games     61
12  Documentary     68
13      Foreign     73
14       Action     64
15     Children     60

In [43]:
# 5. Wyświetl liczbę wszystkich klientów pogrupowanych według kraju.
df = pd.read_sql("SELECT country.country, count(customer.customer_id)\
                            FROM customer\
                        INNER JOIN address ON address.address_id = customer.address_id\
                    INNER JOIN city ON city.city_id = address.city_id\
                        INNER JOIN country ON country.country_id = country.country_id\
                    GROUP BY country\
                    order by country.country", con=connection_sqlalchemy)
df

                  country  count
0             Afghanistan    599
1                 Algeria    599
2          American Samoa    599
3                  Angola    599
4                Anguilla    599
..                    ...    ...
104               Vietnam    599
105  Virgin Islands, U.S.    599
106                 Yemen    599
107            Yugoslavia    599
108                Zambia    599

[109 rows x 2 columns]

In [96]:
# 6. Wyświetl informacje o sklepie, który ma więcej niż 100 klientów i mniej niż 300 klientów.
df = pd.read_sql('SELECT store.store_id, staff.first_name, staff.last_name, address.address, store.last_update \
FROM store \
INNER JOIN customer ON store.store_id = customer.store_id \
INNER JOIN address ON address.address_id = store.address_id \
INNER JOIN staff ON store.manager_staff_id = staff.staff_id \
GROUP BY store.store_id, address.address_id, staff.first_name, staff.last_name \
HAVING COUNT(customer.customer_id) > 100 AND COUNT(customer.customer_id) < 300', con=connection_sqlalchemy)
df

   store_id first_name last_name             address         last_update
0         2        Jon  Stephens  28 MySQL Boulevard 2006-02-15 09:57:12

In [108]:
# 7. Wybierz wszystkich klientów, którzy oglądali filmy ponad 200 godzin.
df = pd.read_sql('''SELECT DISTINCT customer.customer_id, customer.first_name, customer.last_name
FROM customer
INNER JOIN rental ON customer.customer_id = rental.customer_id
WHERE rental.return_date - rental.rental_date > INTERVAL '200 hours'
''', con=connection_sqlalchemy)
df

     customer_id first_name    last_name
0            353   Jonathan  Scarborough
1            101      Peggy        Myers
2            347       Ryan    Salisbury
3            336     Joshua         Mark
4            195    Vanessa         Sims
..           ...        ...          ...
561          598       Wade     Delvalle
562          200     Jeanne       Lawson
563          397      Jimmy     Schrader
564          221     Bessie     Morrison
565            4    Barbara        Jones

[566 rows x 3 columns]

In [44]:
# 8. Oblicz średnią wartość wypożyczenia filmu.
df = pd.read_sql("SELECT AVG(rental.return_date - rental.rental_date) FROM rental", con=connection_sqlalchemy)
df

                     avg
0 5 days 00:36:28.541706

In [50]:
# 9. Oblicz średnią wartość długości filmu we wszystkich kategoriach.
df = pd.read_sql("SELECT category.name, AVG(film.length) \
FROM category \
INNER JOIN film_category ON category.category_id = film_category.category_id \
INNER JOIN film ON film_category.film_id = film.film_id \
GROUP BY category.name", con=connection_sqlalchemy)
df

           name         avg
0        Sports  128.202703
1      Classics  111.666667
2           New  111.126984
3        Family  114.782609
4        Comedy  115.827586
5     Animation  111.015152
6        Travel  113.315789
7         Music  113.647059
8         Drama  120.838710
9        Horror  112.482143
10       Sci-Fi  108.196721
11        Games  127.836066
12  Documentary  108.750000
13      Foreign  121.698630
14       Action  111.609375
15     Children  109.800000

In [89]:
# 10. Znajdź najdłuższe tytuły filmowe we wszystkich kategoriach.
df = pd.read_sql("SELECT distinct category.name, MAX(LENGTH(film.title)) \
FROM category \
INNER JOIN film_category ON category.category_id = film_category.category_id \
INNER JOIN film ON film_category.film_id = film.film_id \
group by category.name\
        order by category.name\
", con=connection_sqlalchemy)
df

           name  max
0        Action   23
1     Animation   22
2      Children   20
3      Classics   23
4        Comedy   23
5   Documentary   22
6         Drama   22
7        Family   22
8       Foreign   20
9         Games   21
10       Horror   27
11        Music   22
12          New   21
13       Sci-Fi   20
14       Sports   25
15       Travel   23

In [87]:
# 11. Znajdź najdłuższy film we wszystkich kategoriach. Porównaj wynik z pkt 10.
df = pd.read_sql("SELECT distinct category.name, MAX(film.length) \
FROM category \
INNER JOIN film_category ON category.category_id = film_category.category_id \
INNER JOIN film ON film_category.film_id = film.film_id \
group by category.name\
        order by category.name\
", con=connection_sqlalchemy)
df

           name  max
0        Action  185
1     Animation  185
2      Children  178
3      Classics  184
4        Comedy  185
5   Documentary  183
6         Drama  181
7        Family  184
8       Foreign  184
9         Games  185
10       Horror  181
11        Music  185
12          New  183
13       Sci-Fi  185
14       Sports  184
15       Travel  185